In [1]:
import pandas as pd
import numpy as np

In [5]:
data = [1,3,5,7,9]
s = pd.Series(data)

In [6]:
s

0    1
1    3
2    5
3    7
4    9
dtype: int64

In [7]:
print(s)

0    1
1    3
2    5
3    7
4    9
dtype: int64

In [15]:
data = {
    'year' : [2016, 2017, 2018],
    'GDP rate' : [2.8, 3.1, 3.0],
    'GDP' : [1, 2, 3]
}

df= pd.DataFrame(data)

In [16]:
df

   year  GDP rate  GDP
0  2016       2.8    1
1  2017       3.1    2
2  2018       3.0    3

In [17]:
print(df)

   year  GDP rate  GDP
0  2016       2.8    1
1  2017       3.1    2
2  2018       3.0    3

In [18]:
df['year']

0    2016
1    2017
2    2018
Name: year, dtype: int64

In [20]:
df[df['year']>=2017]

   year  GDP rate  GDP
1  2017       3.1    2
2  2018       3.0    3

In [22]:
df

   year  GDP rate  GDP
0  2016       2.8    1
1  2017       3.1    2
2  2018       3.0    3

In [23]:
sum = df['GDP rate'].sum()
print(sum)
avg = df['GDP rate'].mean()
print(avg)

8.9
2.966666666666667

In [24]:
df = pd.Series(np.random.randn(5))
print(df)

0   -0.180328
1    1.032194
2   -1.015435
3    0.187258
4    0.439977
dtype: float64

In [25]:
df = pd.Series(np.random.randn(5), index=['a','b','c','d','e'])

In [26]:
df

a   -1.143544
b    2.755875
c   -0.048048
d    0.609877
e    0.167002
dtype: float64

In [27]:
data2 = [{'name':'MARK'},{'name':'ERIC'},{'name':'JENNIFER'}]
df2 = pd.DataFrame(data2)
df2['age']=[10,11,12]

data3 = [{'addr':u'서울'},{'addr':u'경기'},{'addr':u'인천'}]
df3 = pd.DataFrame(data3)

df4 = pd.merge(df2, df3, left_index=True, right_index=True)
print(df4)

       name  age addr
0      MARK   10   서울
1      ERIC   11   경기
2  JENNIFER   12   인천

In [28]:
df2

       name  age
0      MARK   10
1      ERIC   11
2  JENNIFER   12

In [29]:
df3

  addr
0   서울
1   경기
2   인천

In [31]:
df4 = pd.merge([df2, df3], ignore_index=True)

TypeError: merge() got an unexpected keyword argument 'ignore_index'